{
  "architecture": "ordinary_moe",
  "transformers_version_required": "4.51.x",
  "config_dir": "../../../Qwen3-0.6B",
  "data_dir": "../../../dclm/global-shard_01_of_10",
  "dataset_type": "dclm",
  "seq_len": 1024,
  "global_batch_size": 256,
  "learning_rate": 0.0001,
  "router_input": "k",
  "effective_router_input": "post_attention_residual",
  "center_router_input": true,
  "router_normalization": "none",
  "router_bias": false,
  "num_experts": 4,
  "expert_intermediate_size": 3072,
  "local_window": 32,
  "sink_tokens": 4,
  "model_config": {
    "vocab_size": 151936,
    "max_position_embeddings": 40960,
    "hidden_size": 1024,
    "intermediate_size": 3072,
    "num_hidden_layers": 28,
    "num_attention_heads": 16,
    "use_sliding_window": false,
    "sliding_window": null,
    "max_window_layers": 28,
    "num_key_value_heads": 8,
    "head_dim": 128,
    "hidden_act": "silu",
    "initializer_range": 0.02,
    "rms_norm_eps": 1e-06,
    "use_cache": false,
    "rope_theta": 1000000,
    "rope_scaling": null,
    "attention_bias": false,
    "attention_dropout": 0.0,
    "return_dict": true,
    "output_hidden_states": false,
    "output_attentions": false,
    "torchscript": false,
    "torch_dtype": "bfloat16",
    "use_bfloat16": false,
    "tf_legacy_loss": false,
    "pruned_heads": {},
    "tie_word_embeddings": true,
    "chunk_size_feed_forward": 0,
    "is_encoder_decoder": false,
    "is_decoder": false,
    "cross_attention_hidden_size": null,
    "add_cross_attention": false,
    "tie_encoder_decoder": false,
    "max_length": 20,
    "min_length": 0,
    "do_sample": false,
    "early_stopping": false,
    "num_beams": 1,
    "num_beam_groups": 1,
    "diversity_penalty": 0.0,
    "temperature": 1.0,
    "top_k": 50,
    "top_p": 1.0,
    "typical_p": 1.0,
    "repetition_penalty": 1.0,
    "length_penalty": 1.0,
    "no_repeat_ngram_size": 0,
    "encoder_no_repeat_ngram_size": 0,
    "bad_words_ids": null,
    "num_return_sequences": 1,
    "output_scores": false,
    "return_dict_in_generate": false,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "remove_invalid_values": false,
    "exponential_decay_length_penalty": null,
    "suppress_tokens": null,
    "begin_suppress_tokens": null,
    "architectures": [
      "Qwen3ForCausalLM"
    ],
    "finetuning_task": null,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "tokenizer_class": null,
    "prefix": null,
    "bos_token_id": 151643,
    "pad_token_id": null,
    "eos_token_id": 151645,
    "sep_token_id": null,
    "decoder_start_token_id": null,
    "task_specific_params": null,
    "problem_type": null,
    "_name_or_path": "../../../Qwen3-0.6B",
    "_attn_implementation_autoset": true,
    "transformers_version": "4.51.0",
    "model_type": "qwen3",
    "use_moe": false,
    "inverse_kv_architecture": "ordinary_moe",
    "inverse_kv_router_input": "k",
    "inverse_kv_center_router_input": true,
    "inverse_kv_router_normalization": "none",
    "inverse_kv_router_bias": false,
    "inverse_kv_num_experts": 4,
    "inverse_kv_expert_intermediate_size": 3072,
    "inverse_kv_local_window": 32,
    "inverse_kv_sink_tokens": 4
  },
  "parameters": {
    "total": 1388888064,
    "trainable": 1388888064
  }
}